window.doingThings = [
  {
    name: '行楷 30 天练字计划',
    start: '2023/2',
    end: '-',
  },
]


window.finishedTasks = [
  {
    name: '前沿课·吴军讲 GPT',
    start: '2023/04',
    end: '2023/05',
  },
    {
    name: 'AI 大模型之美',
    start: '2023/04',
  },
  {
    name: '超级访谈：对话玉伯',
    start: '2022/10',
    end: '2022/12',
  },
  {
    name: '三体广播剧（喜马拉雅）',
    start: '2021/07/28',
    end:'2021/09',
  },
  {
    name: '吴军·硅谷来信第三季（得到课程）',
    end: '-'
  },
  {
    name: '智胜健身（喜马拉雅）',
    start: '2021/08/08',
    end: '2021/10'
  },
  {
    name: '浏览器工作原理与实践（极客时间）',
    start: '2021/04/20',
    end: '2021/04/29',
  },
  {
    name: '数据结构与算法之美（极客时间）',
    start: '2021/03/30',
    end: '2021/04/17',
  },
  {
    name: '透视HTTP协议（极客时间）',
    start: '2021/03/23',
    end: '2021/04/06',
  },
  {
    name: '香帅的北大金融学课（得到课程）',
    start: '2021/02/13',
    end: '2021/02/23',
  },
  {
    name: '张潇雨·个人投资课（得到课程）',
    start: '2021/02/08',
    end: '2021/02/13',
  },
  {
    name: '跟月影学可视化（极客时间）',
    start: '2020/06/24',
    end: '2020/10/20',
  },
  {
    name: 'The Complete 2020 Flutter Development Bootcamp with Dart (Udemy)',
    start: '2020/05/01',
    end: '2020/06/02',
  },
  {
    name: '许式伟的架构课（极客时间）',
    start: '2020/03/03',
    end: '2020/05/02',
  },
  {
    name: '从 0 打造音视频直播系统（极客时间）',
    start: '2020/01/03',
    end: '2020/01/11',
  },
  {
    name: '学车',
    start: '2019/05/03',
    end: '2020/01/08',
  },
  {
    name: '吴军·数学通识 50 讲（得到音频课程）',
    start: '2019/11/04',
    end: '2019/12/24',
  },
  {
    name: '吴军的谷歌方法论（得到音频课程）',
    start: '2018/01',
    end: '2018/12',
  },
  {
    name: '英语流利说半年计划1',
    start: '2018/01/31',
    end: '2018/07/31',
  },
  {
    name: '14 天地道发音训练营（英语流利说）',
    start: '2018/02/22',
    end: '2018/03/07',
  },
  {
    name: '拓词 - 考研大纲真题高频词 1312 个',
    start: '*',
    end: '2018/11/28',
  },
  {
    name: '扇贝听力 - 句子训练 300 句',
    start: '*',
    end: '2017/12/24',
  },
  {
    name: '扇贝阅读 - 英文文章 60 篇',
    start: '*',
    end: '2017/12/24',
  },
  {
    name: '学游泳计划',
    start: '2017/08/15',
    end: '2018/11/04',
  },
  {
    name: '英语流利说半年计划2',
    start: '2018/09/01',
    end: '2019/01/19'
  },
]


window.readedBooks = [
  {
    name: 'M 型社会',
    start: '2023/7',
    end: '2023/7',
  },
  {
    name: '纳瓦尔宝典',
    start: '2023/7',
    end: '2023/7',
  },
  {
    name: '冲浪板上的公司',
    start: '2023/7',
    end: '2023/7',
  },
  {
    name: '惊人的超慢跑',
    start: '2023/6',
     end: '2023/6',
  },
  {
    name: '解密 instagram: 一款拍照软件如何改变社交',
    start: '2023/6',
     end: '2023/6',
  },
  {
    name: '明日之战',
    start: '2023/6',
     end: '2023/6',
  },
  {
    name: '卓有成效的工程师',
    start: '2023/5',
     end: '2023/6',
  },
  {
    name: '雪崩',
    start: '2023/5',
     end: '2023/5',
  },
  {
    name: '自然语言处理：基于预训练模型的方法',
    start: '2023/5',
    end: '2023/5',
  },
  {
    name: '安卓传奇',
    start: '2023/5',
    end: '2023/5',
  },
  {
    name: '科学之路',
    start: '2023/5',
    end: '2023/5',
  },
  {
    name: 'AIGC 智能创作时代',
    start: '2023/4',
    end: '2023/4',
  },
  {
    name: 'AI 未来进行式（李开复）',
    start: '2023/4',
    end: '2023/4',
  },
  {
    name: '深度学习革命',
    start: '2023/4',
    end: '2023/4',
  },
  {
    name: '硅谷钢铁侠',
    start: '2023/4',
    end: '2023/4',
  },
  {
    name: '芯片战争',
    start: '2023/4',
    end: '2023/4',
  },
  {
    name: '中国历代政治得失（汉英对照）',
    start: '2023/3',
    end: '2023/3',
  },
  {
    name: 'React 设计原理',
    start: '2023/3',
    end: '2023/3',
  },
  {
    name: 'Vue.js 设计与实现',
    start: '2023/3',
    end: '2023/3',
  },
  {
    name: '筚路维艰：中国社会主义路径的五次选择',
    start: '2023/3',
    end: '2023/3',
  },
  {
    name: '解读中国经济（林毅夫）',
    start: '2023/2',
    end: '2023/2',
  },
  {
    name: '从一到无穷大',
    start: '2022/12',
    end: '2023/2',
  },
  {
    name: '邓小平时代',
    start: '2022/12',
    end: '2022/12',
  },
  {
    name: '李光耀观世界',
    start: '2022/12',
    end: '2022/12',
  },
  {
    name: '法治的细节',
    start: '2022/11',
    end: '2022/11',
  },
  {
    name: '可能性的艺术',
    start: '2022/11',
    end: '2022/11',
  },
  {
    name: '置身事内：中国政府与经济发展',
    start: '2022/11',
    end: '2022/11',
  },
  {
    name: '学会提问',
    start: '2022/10',
    end: '2022/11',
  },
  {
    name: '俞军的产品方法论',
    start: '2022/10',
    end: '2022/10',
  },
  {
    name: '幕后产品',
    start: '2022/10',
    end: '2022/10',
  },
  {
    name: '被讨厌的勇气',
    start: '2022/10',
    end: '2022/10',
  },
  {
    name: '小家，越住越大3',
    start: '2022/09',
    end: '2022/09',
  },
  {
    name: '重新定义公司：谷歌是如何运营的',
    start: '2022/09',
    end: '2022/09',
  },
  {
    name: '小家大变局',
    start: '2022/09',
    end: '2022/09',
  },
  {
    name: '赢',
    start: '2022/08',
    end: '2022/09',
  },
  {
    name: '华为管理变革',
    start: '2022/08',
    end: '2022/08',
  },
  {
    name: '影响力大师',
    start: '2022/07',
    end: '2022/08',
  },
  {
    name: '创新者的窘境',
    start: '2022/07',
    end: '2022/08',
  },
  {
    name: '重新定义团队：谷歌如何工作',
    start: '2022/07',
    end: '2022/07',
  },
  {
    name: '装修，做好三件事就够了',
    start: '2022/05',
    end: '2022/06',
  },
  {
    name: '小家，越住越大',
    start: '2022/05',
    end: '2022/05',
  },
  {
    name: '买房可以很简单',
    start: '2022/04',
    end: '2022/04',
  },
  {
    name: '千万别说你懂买房',
    start: '2022/04',
    end: '2022/04',
  },
  {
    name: '腾讯传',
    start: '2022/02',
    end: '2022/02',
  },
  {
    name: '一往无前',
    start: '2022/01',
    end: '2022/02',
  },
  {
    name: '沸腾新十五年',
    start: '2022/01',
    end: '2022/01',
  },
  {
    name: '沸腾新十年（下）',
    start: '2022/01',
    end: '2022/01',
  },
  {
    name: '沸腾新十年（上）',
    start: '2022/01',
    end: '2022/01',
  },
  {
    name: '吴军阅读与写作讲义',
    start: '2022/01',
    end: '2021/12',
  },
  {
    name: '计算之魂',
    start: '2021/12',
    end: '2021/12',
  },
  {
    name: '图解设计模式',
    start: '2021/12',
    end: '2021/12',
  },
  {
    name: '重构（第二版）',
    start: '2021/11',
    end: '2021/11',
  },
  {
    name: '代码整洁之道',
    start: '2021/11',
    end: '2021/11',
  },
  {
    name: '代码整洁之道（程序员的职业素养）',
    start: '2021/11',
    end: '2021/11',
  },
  {
    name: '超新星纪元',
    start: '2021/07/22',
    end: '2021/07/28',
  },
  {
    name: '球状闪电',
    start: '2021/07/17',
    end: '2021/07/19',
  },
  {
    name: '支付战争',
    start: '2021/04/17',
    end: '2021/04/21',
  },
  {
    name: '蒂姆·库克传',
    start: '2021/03/01',
    end: '2021/03/09',
  },
  {
    name: '不拘一格',
    start: '2021/01/13',
    end: '2021/02/03',
  },
  {
    name: '自动时代',
    start: '2020/12/15',
    end: '2021/12/29',
  },
  {
    name: 'webgl 编程指南',
    start: '2020/06/23',
    end: '2020/07/15',
  },
  {
    name: '在线（王坚）',
    start: '2019/11/24',
    end: '2020/07/06',
  },
  {
    name: '数学大师',
    start: '2019/11/01',
    end: '2019/12/26',
  },
  {
    name: '人类的群星闪耀时',
    start: '2019/10/17',
    end: '2019/12/18',
  },
  {
    name: '数学女孩（1-4）',
    start: '2019/09/28',
    end: '2019/10/20',
  },
  {
    name: '世界观',
    start: '2019/09/07',
    end: '2019/10/16',
  },
  {
    name: '全球科技通史',
    start: '2019/09/22',
    end: '2019/10/14',
  },
  {
    name: '时间的形状：相对论史话',
    start: '2019/09/16',
    end: '2019/09/21',
  },
  {
    name: '上帝掷骰子吗？：量子物理实话',
    start: '2019/09/07',
    end: '2019/09/16',
  },
  {
    name: '浪潮之巅(第四版 下)',
    start: '2019/08/07',
    end: '2019/09/06',
  },
  {
    name: 'Google 软件测试之道',
    start: '2019/08/22',
    end: '2019/08/29',
  },
  {
    name: '编程大师访谈录',
    start: '2019/08/10',
    end: '2019/08/22',
  },
  {
    name: 'Electron in action',
    start: '2019/07/22',
    end: '2019/08/09',
  },
  {
    name: '大型网站技术架构：核心原理与案例分析',
    start: '2019/07/22',
    end: '2019/08/07',
  },
  {
    name: '浪潮之巅(第四版 上)',
    start: '2019/07/16',
    end: '2019/08/06',
  },
  {
    name: '启示录',
    start: '2019/07/02',
    end: '2019/07/15',
  },
  {
    name: 'iOS Apprentice (7th version)',
    start: '2019/05/26',
    end: '2019/07/05',
  },
  {
    name: 'Developing iOS 11 Apps with Swift (Stanford 视频)',
    start: '2019/04/27',
    end: '2019/05/26',
  },
  {
    name: '史蒂夫·乔布斯传',
    start: '2019/04/17',
    end: '2019/04/28',
  },
  {
    name: '数据可视化实战（使用 D3 设计交互式图表）',
    start: '2019/04/15',
    end: '2019/04/17',
  },
  {
    name: '刷新',
    start: '2019/04/14',
    end: '2019/04/16',
  },
  {
    name: '数据可视化（第二版 陈为）',
    start: '2019/04/1',
    end: '2019/04/11',
  },
  {
    name: '高效能人士的七个习惯',
    start: '2019/04/06',
    end: '2019/04/07',
  },
  {
    name: '演讲的力量',
    start: '2019/03/23',
    end: '2019/04/06',
  },
  {
    name: '企业 IT 架构之道：阿里巴巴中台战略思想与架构实战',
    start: '2019/03/23',
    end: '2019/03/31',
  },
  {
    name: 'MongoDB 权威指南（第二版）',
    start: '2019/03/09',
    end: '2019/03/22',
  },
  {
    name: '编码--隐匿在计算机软硬件背后的语言',
    start: '2019/02/03',
    end: '2019/02/06',
  },
  {
    name: '深入浅出 webpack',
    start: '2019/01/19',
    end: '2019/01/20',
  },
  {
    name: '图解 HTTP',
    start: '2018/12/30',
    end: '2018/12/24',
  },
  {
    name: '你不知道的 javascript（下卷）',
    start: '2018/12/16',
    end: '2018/12/17',
  },
  {
    name: '你不知道的 javascript（中卷）',
    start: '2018/12/15',
    end: '2018/12/08',
  },
  {
    name: '你不知道的 javascript（上卷）',
    start: '2018/12/03',
    end: '2018/12/08',
  },
  {
    name: 'CSS 世界（张鑫旭）',
    start: '2018/10/26',
    end: '2018/11/02',
  },
  {
    name: '程序员代码面试指南（IT 名企算法与数据结构题目最优解）',
    start: '2018/09/24',
    end: '2018/10/31',
  },
  {
    name: '码农翻身',
    start: '2018/10/05',
    end: '2018/10/07',
  },
  {
    name: '现代操作系统',
    start: '2018/09/29',
    end: '2018/10/05',
  },
  {
    name: '编写高质量代码：改善Python程序的91个建议',
    start: '2018/09/22',
    end: '2018/09/25',
  },
  {
    name: 'Effective Python: 编写高质量Python代码的59个有效方法',
    start: '2018/09/12',
    end: '2018/09/22',
  },
  {
    name: 'NoSQL 精粹',
    start: '2018/08/14',
    end: '2018/08/17',
  },
  {
    name: '深入理解 Flask',
    start: '2018/08/14',
    end: '2018/08/16',
  },
  {
    name: 'The Django Book',
    link: 'http://djangobook.py3k.cn/',
    start: '2018/08/08',
    end: '2018/08/13',
  },
  {
    name: '人工智能基础（高中版）',
    start: '2018/06/06',
    end: '2018/06/06',
  },
  {
    name: '流畅的 python',
    start: '2018/05/19',
    end: '2018/06/08',
  },
  {
    name: '网易云课堂 程序设计入门———python',
    link: 'http://mooc.study.163.com/learn/1000002017?tid=2001464005#/learn/announce',
    start: '2018/05/06',
    end: '2018/05/20',
  },
  {
    name: '大规模分布式存储系统（原理解析与架构实战）',
    start: '2018/05/01',
    end: '2018/05/06',
  },
  {
    name: '精通 Git（第 2 版）',
    start: '2019/04/29',
    end: '2018/05/01',
  },
  {
    name: '图灵和 ACM 图灵奖（1966 - 2015 第五版）纪念计算机诞生 70 周年',
    start: '2019/04/21',
    end: '2018/04/30',
  },
  {
    name: '智能时代 吴军',
    start: '2018/04/14',
    end: '2018/04/20',
  },
  {
    name: '鸟叔的 linux 私房菜',
    start: '2018/04/1',
    end: '2018/04/14',
  },
  {
    name: 'redis 实战',
    start: '2018/03/23',
    end: '2018/04/01',
  },
  {
    name: 'just for fun 只是为了好玩（Linux 自传）',
    start: '2018/03/28',
    end: '2018/03/31',
  },
  {
    name: '云计算架构技术与实践(第2版)',
    start: '2018/03/04',
    end: '2018/03/17',
  },
  {
    name: '云计算通俗讲义(第2版)',
    start: '2018/03/03',
    end: '2018/03/04',
  },
  {
    name: '编程之美',
    start: '*',
    end: '2017/11/11',
  },
  {
    name: '数学之美',
    start: '*',
    end: '2017/10/22',
  },
  {
    name: '普林斯顿微积分读本',
    start: '*',
    end: '2017/10/18',
  },
  {
    name: '麻省理工公开课：微积分重点',
    link: 'http://open.163.com/special/opencourse/weijifen.html',
    start: '*',
    end: '2017/10/18',
  },
  {
    name: '贝叶斯方法 概率编程与贝叶斯推断',
    start: '*',
    end: '2017/10/06',
  },
  {
    name: '概率论与数理统计 陈希孺',
    start: '*',
    end: '2017/10/06',
  },
  {
    name: '中国大学MOOC 概率论与数理统计 哈尔滨工业大学',
    link: 'http://www.icourse163.org/learn/HIT-1001518002?tid=1002163035',
    start: '*',
    end: '2017/09/30',
  },
  {
    name: '线性代数的本质',
    link: 'http://www.bilibili.com/video/av6731067/index_1.html#page=1',
    start: '*',
    end: '2017/09/22',
  },
  {
    name: '麻省理工公开课：线性代数',
    link: 'http://open.163.com/special/opencourse/daishu.html',
    start: '*',
    end: '2017/09/22',
  },{
    name: '中国大学MOOC 计算机图形学 中国农业大学',
    link: 'http://www.icourse163.org/course/CAU-45006',
    start: '*',
    end: '2017/09/10',
  },
  {
    name: '线性代数',
    start: '*',
    end: '2017/09/03',
  },
  {
    name: '计算机图形学与几何造型导论',
    start: '*',
    end: '2017/09/03',
  },
  {
    name: '了解 Blender 的基本使用，[台湾大神的blender教程全集]',
    link: 'http://www.bilibili.com/video/av909518/index_37.html#page=1',
    start: '*',
    end: '2017/08/13',
  },
  {
    name: 'Three.js 开发指南',
    start: '*',
    end: '2017/08/12',
  },
  {
    name: 'WebGL 编程指南',
    start: '*',
    end: '2017/08/03',
  },
]
